#include "Link.h"

using namespace Eigen;

RobotLink::RobotLink()
{
    ID=0;        //自分のID

    parentID=0;  //親リンクのID

    p={0.0,0.0,0.0};     //絶対位置
    v={0.0,0.0,0.0};     //絶対速度


    R<<1.0,0.0,0.0,
       0.0,1.0,0.0,
       0.0,0.0,1.0;     //絶対姿勢

    a={0.0,0.0,0.0};     //関節軸ベクトル
    b={0.0,0.0,0.0};     //相対位置ベクトル

    c_={0.0,0.0,0.0};    //相対重心位置
    c={0.0,0.0,0.0};     //絶対重心位置

    m=0.0;      //質量[kg]

    q=0.0;      //関節変位[rad]
    qref=0.0;   //目標関節変位[rad]

    get_q=0.0;
    get_c=0.0;
}

Robot::Robot()
{
        CoG={0.0, 0.0, 0.0};
        M_cog={0.0, 0.0, 0.0};
        M=0.0;
}