#include "Link.h"

using namespace Eigen;

RobotLink::RobotLink()
{
    ID=0;        //自分のID

    parentID=0;  //親リンクのID

    p={0.0,0.0,0.0};     //絶対位置
    v={0.0,0.0,0.0};     //絶対速度
    acc={0.0,0.0,0.0};     //絶対加速度


    R<<1.0,0.0,0.0,
       0.0,1.0,0.0,
       0.0,0.0,1.0;     //絶対姿勢

    a={0.0,0.0,0.0};     //関節軸ベクトル
    b={0.0,0.0,0.0};     //相対位置ベクトル

    c_={0.0,0.0,0.0};    //相対重心位置
    c={0.0,0.0,0.0};     //絶対重心位置

    m=0.0;      //質量[kg]

    q=0.0;      //関節変位[rad]
    qref=0.0;   //目標関節変位[rad]

    p_self={0.0,0.0,0.0}; //自己座標系から見た時の位置

    R_self<<1.0,0.0,0.0,
            0.0,1.0,0.0,
            0.0,0.0,1.0;   //自己座標系から見た時の姿勢

    p_gnd={0.0,0.0,0.0};//地面座標系から見た時の位置

    R_gnd<<1.0,0.0,0.0,
            0.0,1.0,0.0,
            0.0,0.0,1.0;  //地面座標系から見た時の姿勢

    c_self={0.0,0.0,0.0};//自己座標系から見た時の各リンク重心位置

    get_q=0.0;
    get_c=0.0;
}

Robot::Robot()
{
        CoG={0.0, 0.0, 0.0};
        CoGref={0.0, 0.0, 0.0};
        dCoGref={0.0, 0.0, 0.0};
        ddCoGref={0.0, 0.0, 0.0};
        M_cog={0.0, 0.0, 0.0};
        M=0.0;

        CoG_self={0.0, 0.0, 0.0};
        CoG_gnd={0.0, 0.0, 0.0};
        p_s_gnd={0.0, 0.0, 0.0}; //自己座標系から見た時の地面座標系の位置
        R_s_gnd<<1.0,0.0,0.0,
                 0.0,1.0,0.0,
                 0.0,0.0,1.0;  //自己座標系から見た時の地面座標系の姿勢
        p_g_self={0.0, 0.0, 0.0}; //地面から見た時の自己座標系の位置
        R_g_self<<1.0,0.0,0.0,
                 0.0,1.0,0.0,
                 0.0,0.0,1.0;  //地面座標系から見た時の自己座標系の位置

        p_O_GND={0.0, 0.0, 0.0};//歩き初めの位置からの見た時の地面座標系の位置
       
       for(int i=0;i<2;i++)
       {
        CoG_O_GND[i]={0.0, 0.0, 0.0};//歩き初めの位置からの見た時の重心位置
        dCoG_O_GND[i]={0.0, 0.0, 0.0};
        p_body_GND[i]={0.0, 0.0, 0.0};//歩き始めの位置から見た時のボディ位置
        dp_body_GND[i]={0.0, 0.0, 0.0};
       }
        ddCoG_O_GND={0.0, 0.0, 0.0};
        ddp_body_GND={0.0, 0.0, 0.0};

}